:PROPERTIES:
:ID:       84d548b9-50e8-497e-b0d1-3d54c035d023
:END:
#+TITLE: Two-component plasma
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-25 Thu 17:40]
| Headline                 | Time   |
|--------------------------+--------|
| *Total time*             | *5:02* |
|--------------------------+--------|
| 3.4 Two-component plasma | 5:02   |
#+END
* 3.4 Two-component plasma
:LOGBOOK:
CLOCK: [2024-04-25 Thu 11:26]--[2024-04-25 Thu 16:28] =>  5:02
:END:
Next: [[id:32f1cafc-944a-458b-b87f-29abf0653558][Two-dimensional electron gas in a magnetic field]]

** 3.4.1

*Show that the Vlasov equations for this two-component system are*

\begin{equation*}
\bigg[\partial_t + \frac{\vec{p}}{m_{+}} \cdot \partial_{\vec{q}} + e \partial_{\vec{q}} \Phi_{\mathrm{eff}} \cdot \partial_{\vec{p}}\bigg] f_{+}(\vec{p},\,\vec{q},\,t) = 0  
\end{equation*}

\begin{equation*}
\bigg[\partial_t + \frac{\vec{p}}{m_{-}} \cdot \partial_{\vec{q}} - e \partial_{\vec{q}} \Phi_{\mathrm{eff}} \cdot \partial_{\vec{p}}\bigg] f_{-}(\vec{p},\,\vec{q},\,t) = 0  
\end{equation*}

*where the effective Coulomb potential is given by*

\[
\Phi_{\mathrm{eff}}(\vec{q},\,t) = \Phi_{\mathrm{ext}}(\vec{q}) + e \int \mathrm{d} \mathbf{x}^{\prime}\,C(\vec{q} - \vec{q}^{\prime})\,\big[f_{+}(\mathbf{x}^{\prime},\,t) - f_{-}(\mathbf{x}^{\prime},\,t)\big]
\]

*Here,* \( \Phi_{\text{ext}} \) *is the potential set up by the external charges, and the Coulomb potential* \( C(\vec{q}) \) *satisfies the differential equation* \( \nabla^2 C = 4 \pi \delta^3(\vec{q}) \).

The Hamiltonian is

\begin{equation*}
H = \underbrace{\bigg[ \sum_{i=1}^{N} \frac{p_i^2}{2m_{+}} + e \, \Phi_{\text{eff}} (\vec{q}_i,\,t) \bigg]}_{\equiv H_{\text{ions}}} + \underbrace{\bigg[ \sum_{j=1}^{N} \frac{p_j^2}{2 m_{-}} - e\,\Phi_{\text{eff}} (\vec{q}_j,\,t) \bigg]}_{\equiv H_{\text{electrons}}}  \tag{1}  
\end{equation*}

By analogy with [[id:7e249727-e935-4729-87a9-d575fc34052e][the Vlasov equation]], we obtain

\[
\big[\partial_t + (\vec{p} / m_{+}) \cdot \partial_{\vec{q}} + e\,\partial_{\vec{q}} \,\Phi_{\text{eff}} (\vec{q},\,t) \cdot \partial_{\vec{p}} \big]\,f_{+}(\vec{p},\,\vec{q},\,t) = 0
\]

\[
\big[\partial_t + (\vec{p} / m_{-}) \cdot \partial_{\vec{q}} - e\,\partial_{\vec{q}}\,\Phi_{\text{eff}} (\vec{q},\,t) \cdot \partial_{\vec{p}} \big]\,f_{-}(\vec{p},\,\vec{q},\,t) = 0
\]

** 3.4.2 
*Assume that the one-particle densities have the stationary forms* \(f_{\pm} = g_{\pm}(\vec{p})\,n_{\pm}(\vec{q})\). *Show that the effective potential satisfies the equation*

\[
\nabla^2\,\Phi_{\mathrm{eff}} = 4 \pi \, \rho_{\mathrm{ext}} + 4 \pi e \, \big[n_{+}(\vec{q}) - n_{-}(\vec{q})\big]
\]

*where* \(\rho_{\text{ext}}\) *is the external charge density.*

By definition

\[
\Phi_{\mathrm{eff}}(\vec{q},\,t) = \Phi_{\mathrm{ext}}(\vec{q}) + e \int \mathrm{d} \mathbf{x}^{\prime}\, C(\vec{q} - \vec{q}^{\prime})\,\big[f_{+}(\mathbf{x}^{\prime},\,t) - f_{-}(\mathbf{x}^{\prime},\,t)\big].
\]

Substituting  \(f_{\pm} = g_{\pm}(\vec{p})\,n_{\pm}(\vec{q})\) and integrating over \( g_{\pm} (\vec{p}) \) we get

\begin{align*}
\Phi_{\mathrm{eff}}(\vec{q},\,t) &= \Phi_{\mathrm{ext}}(\vec{q}) + e \int \mathrm{d}^3 \vec{q}^{\thinspace \prime} \, \mathrm{d}^3 \vec{p}^{\thinspace \prime} \,C(\vec{q} - \vec{q}^{\thinspace \prime})\,\big[g_{+}(\vec{p}^{\thinspace \prime})\,n_{+}(\vec{q}^{\thinspace \prime}) - g_{-}(\vec{p}^{\thinspace \prime})\,n_{-}(\vec{q}^{\thinspace \prime})\big] \\
&= \Phi_{\mathrm{ext}}(\vec{q}) + e \int \mathrm{d}^3 \vec{q}^{\thinspace \prime} \, C(\vec{q} - \vec{q}^{\thinspace \prime})\,\bigg[n_{+}(\vec{q}^{\thinspace \prime}) \underbrace{\bigg(\int \mathrm{d}^3 \vec{p}^{\thinspace \prime} \, g_{+}(\vec{p}^{\thinspace \prime}) \bigg)}_{\equiv 1} - n_{-}(\vec{q}^{\thinspace \prime}) \underbrace{\bigg(\int \mathrm{d}^3 \vec{p}^{\thinspace \prime} \, g_{-}(\vec{p}^{\thinspace \prime}) \bigg)}_{\equiv 1} \bigg] \\
&= \Phi_{\mathrm{ext}}(\vec{q}) + e \int \mathrm{d}^3 \vec{q}^{\thinspace \prime}\, C(\vec{q} - \vec{q}^{\thinspace \prime})\,\big[n_{+}(\vec{q}^{\thinspace \prime}) - n_{-}(\vec{q}^{\thinspace \prime}) \big].
\end{align*}

Under the action of the [[id:347b7b19-6382-4038-9941-dfcae1888856][Laplacian operator]] \( \nabla^2 \), the equation transform as (see [[id:66b521f2-0abe-45ee-9b0b-b56ce82900b2][divergence of electric field]] if manipulations are not obvious)

\begin{align*}
\nabla^2 \, \Phi_{\mathrm{eff}} &= \overbrace{\nabla^2 \, \Phi_{\mathrm{ext}}(\vec{q})}^{\equiv 4 \pi \rho_{\text{ext}}} + e \int \mathrm{d}^3 \vec{q}^{\thinspace \prime}\, \overbrace{\nabla^2 \,C(\vec{q} - \vec{q}^{\thinspace \prime})}^{\equiv 4 \pi \delta^3 (\vec{q} - \vec{q}^{\thinspace \prime})}\,\big[n_{+}(\vec{q}^{\thinspace \prime}) - n_{-}(\vec{q}^{\thinspace \prime}) \big] \\
&= 4 \pi \rho_{\text{ext}} + 4 \pi e \int \mathrm{d}^3 \vec{q}^{\thinspace \prime}\,\delta^3 (\vec{q} - \vec{q}^{\thinspace \prime})\,\big[n_{+}(\vec{q}^{\thinspace \prime}) - n_{-}(\vec{q}^{\thinspace \prime}) \big] \\
&= 4 \pi \big[ \rho_{\text{ext}} + e \,\big[n_{+}(\vec{q}) - n_{-}(\vec{q}) \big].
\end{align*}

** 3.4.3 
*Further assuming that the densities relax to the equilibrium Boltzmann weights* \( n_{\pm}(\vec{q}) = n_0 \exp(\pm \beta\,e\,\Phi_{\text{eff}}(\vec{q})) \) *leads to the self-consistency condition*

\[
\nabla^2 \Phi_{\mathrm{eff}} = 4 \pi \, \big[\rho_{\mathrm{ext}} +  e \big( n_0 \big[\exp (\beta\,e\,\Phi_{\mathrm{eff}}) - \exp (-\beta\,e\,\Phi_{\mathrm{eff}}) \big] \big) \big]
\]

*known as the Poisson-Boltzmann equation. Due to its non-linear form, it is generally not possible to solve the Poisson-Boltzmann equation. By linearizing the exponentials, one obtains the simpler Debye equation*

\[
\nabla^2 \Phi_{\mathrm{eff}} = 4 \pi \rho_{\mathrm{ext}} + \lambda^{-2} \Phi_{\mathrm{eff}}
\]

*Give the expression for the Debye screening length* \( \lambda \).

Using \( \exp (x) \approx 1 + x \) for sufficiently small \( x \), the *Poisson-Boltzmann equation* transforms as

\[
\nabla^2 \Phi_{\mathrm{eff}} = 4 \pi \, \big[\rho_{\mathrm{ext}} +  e \big( n_0 \big[ 2\beta e\,\Phi_{\text{eff}} \big] \big) \big].
\]

This is the *Debye equation*. Matching coefficients with the form

\[
\nabla^2 \Phi_{\mathrm{eff}} = 4 \pi \rho_{\mathrm{ext}} + \lambda^{-2} \Phi_{\mathrm{eff}}
\]

we read off the *Debye screening length* \(\lambda \equiv (8 \pi\,\beta\,n_0\,e^2)^{-1/2}\).
** 3.4.4 
*Show that the Debye equation has the general solution*

\[
\Phi_{\mathrm{eff}} (\vec{q}) = \int \mathrm{d}^3 \vec{q}^{\prime}\,G (\vec{q} - \vec{q}^{\thinspace \prime}) \, \rho_{\mathrm{ext}}(\vec{q}^{\thinspace \prime}) 
\]

*where* \(G(\vec{q}) =  \lvert \vec{q} \rvert^{-1} \, \exp(- \lvert \vec{q} \rvert / \lambda)\) *is the screened Coulomb potential.*

A rewrite of the Debye equation \( \big(\nabla^2 - \lambda^{-2} \big)\,\Phi_{\mathrm{eff}} = 4 \pi \, \rho_{\mathrm{ext}}\) is called the *screened Poisson equation*. Removing the inhomogeneity yields the *Helmholtz equation* i.e., \((\nabla^2 - \lambda^{-2})\, \Phi_{\text{eff}} (\vec{q}) = 0 \). Here \( \nabla^2 \) is the [[id:347b7b19-6382-4038-9941-dfcae1888856][Laplacian operator]].

The proposed general solution is reminiscent of the convolution \( G(\vec{q} - \vec{q}^{\thinspace \prime}) \ast \rho_{\text{ext}} (\vec{q}^{\thinspace \prime})\), which suggests the \( G(\vec{q}) =  \lvert \vec{q} \rvert^{-1} \, \exp(- \lvert \vec{q} \rvert / \lambda) \) is the [[id:f62d1df2-edc2-49a3-a4aa-c56fb4a5189a][Green's function]] for the /linear/ [[id:08acb081-f7cf-41ce-8c6d-e1a3a1887b5f][differential operator]] \(\mathrm{L} \equiv \big(\nabla^2 - \lambda^{-2} \big)\). The Green's function \( G(\vec{q}) \) for \( \mathrm{L} \) is a solution of the Helmholtz equation, i.e., \( \mathrm{L} G(\vec{q}) = \delta (\vec{q}) \), where \( \delta (\vec{q}) \) is the [[id:129a3159-a355-485b-b23a-a308063b98fc][Dirac delta function]]. If \( G(\vec{q}) \) is in fact \((\nabla^2 - \lambda^{-2})\)'s Green's function, then \((\nabla^2 - \lambda^{-2}) G(\vec{q}) = \delta (\vec{q}) \) must hold. This is easily verified by evaluating \( \nabla^2 G (\vec{q}) \stackrel{?}{=} \lambda^{-2} G(\vec{q}) \). 

Because \( G(\vec{q}) \)'s dependendence on \( \vec{q} \) is via \( \lvert \vec{q} \rvert \) and  \( \lvert \vec{q} \rvert \) only, the problem has spherical symmetry. [[id:9b149a74-f823-4dc5-8aa3-cba9d7879fa0][Changing coordinates]] to spherical polar, we have \(G(\vec{q}) \to G(r) = r^{-1}\,\exp(- r/\lambda)\) and \( \nabla^{2} \equiv r^{-2} \, \partial_r (r^2 \, \partial_r) \). We will now evaluate evaluating \( \nabla^2 G (r) \stackrel{?}{=} \lambda^{-2} G(r) \).

\begin{align*}
\lambda^{-2} \,G(r) &\stackrel{?}{=} r^{-2} \, \partial_r [r^2 \, \partial_r \, G(r)] \\
&\stackrel{?}{=} r^{-2} \, \partial_r \bigg(- r \lambda^{-1} \exp (- r / \lambda) - \exp (- r / \lambda) \bigg) \\
&\stackrel{?}{=} r^{-2} \, \bigg(r \lambda^{-2} \exp (- r / \lambda) - \lambda^{-1} \exp (- r / \lambda) + \lambda^{-1} \exp (- r / \lambda) \bigg) \\
&\stackrel{?}{=} \lambda^{-2} r^{-1} \exp (- r / \lambda ) = \lambda^{-2} G(r).
\end{align*}

\( G(\vec{q}) \) is indeed the Green's function for \((\nabla^2 - \lambda^{-2})\), so the general solution \(\Phi_{\text{eff}} (\vec{q})\) of \( \big(\nabla^2 - \lambda^{-2} \big)\,\Phi_{\mathrm{eff}} = 4 \pi \, \rho_{\mathrm{ext}}\) is obtained as

\[
\Phi_{\mathrm{eff}} (\vec{q}) = \int \mathrm{d}^3 \vec{q}^{\thinspace \prime}\,G (\vec{q} - \vec{q}^{\thinspace \prime}) \, \rho_{\mathrm{ext}}(\vec{q}^{\thinspace \prime}).
\]

** 3.4.5 
*Give the condition for the self-consistency of the Vlasov approximation, and interpret it in terms of the interparticle spacing.*

The Vlasov equation is applicable when \( 1 \ll n_0\, \lambda^3\), where \( n_0 = N / V\) is the particle density and \(\lambda\) is the Debye screening length. In (3.4.3), we found  \(\lambda \equiv (8 \pi\,\beta\,n_0\,e^2)^{-1/2}\). Substituting in \(1 \ll n_o \lambda^3 \) and simplifying

\[
1 \ll n_0 (8 \pi\,\beta\,n_0\,e^2)^{-3/2} \approx n_0^{-1/2} (k_B\,T)^{3/2} e^{-3} \approx n_0^{-1/3} (k_B\,T) e^{-2} \Longrightarrow (e^2 / k_B T) \ll n_0^{-1/3} \sim l \Longrightarrow (e^2/l) \ll k_B T.
\]

Here \( l \) is the interparticle spacing. The physical interpretation of the condition \( (e^2/l) \ll k_B T \) is that the typical kinetic energy must be much larger than the typical interaction energy.

** 3.4.6 
*Show that the characteristic relaxation time* \( (\tau \approx \lambda / v) \) *is temperature-independent. What property of the plasma is it related to?*

\( E \approx m\,v^2 \) and \( E \approx k_B T \), hence \( c \sim (k_B\,T/m)^{1/2} \). Using \(\lambda \sim (k_B T)^{1/2} n_0^{-1/2} e^{-1}\), \(\tau \approx \lambda / v \sim e^{-1}\,m^{1/2}\,n_0^{-1/2} \sim \omega_p^{-1}\). Clearly, \( \tau \) is temperature-independent. Here \( \omega_p \) is the *plasma frequency*. This frequency is related to the oscillations in the number density \( n_0 \) of electrons in the plasma (called *plasma oscillations* or *Langmuir waves*).
** Answers
This is the classical version of the "Landau Levels" problems we recently solved in \(Q M I\) class!
(a) \(H=\sum_i\left[\frac{\left(\overrightarrow{p_i}+e \vec{A}\right)^2}{2 m} \pm \mu_B|\vec{B}|\right], \vec{A}=\vec{B} \times \vec{q} / 2\)
- Expand, substitute, simplify...
\begin{align*}
H=\frac{p^2}{2 m}+\frac{e}{2 m} \vec{p} \times \vec{B} \cdot \vec{q}+\frac{e^2}{8 m}\left(B^2 q^2-(\vec{B} \cdot \vec{q})^2\right) \pm \mu_B|\vec{B}|
\end{align*}
- The canonical equations are
\begin{align*}
\begin{aligned}
& -\frac{e}{2 m} \vec{p} \times \vec{B}-\frac{e^2}{4 m} B^2 \vec{q}+\frac{e^2}{4 m}(\vec{B} \cdot \vec{q}) \vec{B} \\
&
\end{aligned}
\end{align*}
- To recast in Newton's second I sw form, solve the first equation for p, differedtitle w.r.t time and substitute in the second equation.
\begin{align*}
\begin{aligned}
& m \ddot{\vec{q}}-\frac{e}{2} \vec{B} \times \dot{\vec{q}}=-\frac{e}{2 m} \vec{p} \times \vec{B}-\frac{e^2}{4 m} B^2 \vec{q}+\frac{e^2}{4 m}(\vec{B} \cdot \vec{q}) \vec{B} \\
& =\frac{-e}{2 m}\left[m \dot{\vec{q}}-\frac{e}{2} \vec{B} \times \vec{q}\right] \times \vec{B} \\
& -\frac{e^2}{4 m}\left(B^2 \vec{q}-(\vec{B} \cdot \vec{q}) \vec{B}\right) \\
& =\frac{e}{2} \vec{B} \times \dot{\vec{q}} \quad(\vec{a} \times(\vec{b} \times \vec{c})=\vec{b}(\vec{c} \cdot \vec{a})-\vec{c}(\vec{a} \cdot \vec{b}) \\
& m \ddot{\vec{q}}=e \vec{B} \times \dot{\vec{q}} \\
& (\vec{a} \times \vec{b}) \times \vec{c}=\vec{b}(\vec{c} \cdot \vec{a})-\vec{a} \cdot(\vec{b} \cdot \vec{b}) \\
&
\end{aligned}
\end{align*}
- Finally,
(vector triple brevet)

\begin{align*}
m \ddot{\vec{q}}=e \vec{B} \times \dot{\vec{q}} \leftarrow
\end{align*}

Lorentz force, with no electric
or \(\quad \ddot{\vec{q}}=\overrightarrow{\omega_c} \times \dot{\vec{q}}\)
\begin{align*}
\begin{aligned}
q & =\vec{w}_c \times \vec{q} \\
\left|\overrightarrow{\omega_c}\right| & =e \mid \overrightarrow{B V} / m
\end{aligned}
\end{align*}
cyclotron frequency field.
(b) - To write the Boltzmann equations for \(f_{\uparrow}(\vec{p}, \vec{q}, t)\) and \(f \downarrow(\vec{p}, \vec{q}, t)\), we need to include two terns in the collisions \(F\) integral os a given spin can collide, in a spin conserving manner, in the two following ways:
\begin{align*}
\begin{aligned}
& \left.\left.\begin{array}{l}
\uparrow \not \uparrow \rightarrow \uparrow \uparrow \\
\downarrow \succ \downarrow \rightarrow \downarrow \downarrow
\end{array}\right\}_{\uparrow}, \quad \begin{array}{l}
\sigma_{>} \downarrow \rightarrow \uparrow \downarrow \\
\downarrow \chi \uparrow \rightarrow \downarrow \uparrow
\end{array}\right\} \sigma_x \\
& \text { cross-section } \\
& \text { of the collision } \\
& \text { cross-section } \\
& \text { of the collision } \\
&
\end{aligned}
\end{align*}
- The streaming terms for exch spin type are like - (1)
\begin{align*}
\frac{\partial f_{\downarrow}}{\partial t}-\left\{H_{\downarrow}, f_{\downarrow}\right\}=\int d^2 p d \Omega\left|\frac{\overrightarrow{p_1}-\overrightarrow{p_2}}{m}\right| \times\{
\end{align*}
\begin{align*}
\begin{aligned}
& {\left[\frac{d \sigma}{d \Omega}\left[f_{\downarrow}\left(\vec{p}_1^{\prime}\right) f_{\downarrow}\left(\overrightarrow{p_2^{\prime}}\right)-f_{\downarrow}\left(\vec{p}_1\right) f_{\downarrow}\left(\vec{p}_2\right)\right]\right]+} \\
& {\left[\frac{d \sigma_x}{d \Omega}\left[f_{\downarrow}\left(\vec{p}_1^{\prime}\right) f_{\uparrow}\left(\vec{p}_2^{\prime}\right)-f_{\downarrow}\left(\overrightarrow{p_1}\right) f_{\uparrow}\left(\overrightarrow{p_2}\right)\right]\right]}
\end{aligned}
\end{align*}
(c) \(H \equiv H_{\uparrow}+H_{\downarrow} \equiv\left(H_{\uparrow \uparrow}+H_{\uparrow \downarrow}\right)+\left(H_{\downarrow \downarrow}+H_{\downarrow \uparrow}\right)\)
- Linearity of the derivative and the integrals allows us to proceed with each of the above terms separately, in the standard manner that the H-theorem is proved. (They are in one to on ell correspondence with the collision integrals).
- The consequence is:
\begin{align*}
\begin{aligned}
& \frac{d H_{\uparrow \uparrow}}{d t} \leqslant 0, \quad \frac{d H_{\uparrow \downarrow}}{d t} \leqslant 0, \frac{d H_{\downarrow \downarrow}}{d t} \leqslant 0, \frac{d H_{\downarrow}}{d t} \leqslant 0 \\
\Rightarrow \quad & \frac{d}{d t}\left(H_{\uparrow \uparrow}+H_{\uparrow \downarrow}\right) \leqslant 0, \frac{d}{d t}\left(H_{\downarrow \downarrow}+H_{\downarrow \uparrow}\right) \leqslant 0
\end{aligned}
\end{align*}
or \(\frac{d}{d t}\left(H_{\uparrow}\right) \leqslant 0, \frac{d}{d t}\left(H_{\downarrow}\right) \leqslant 0\)
or \(\frac{d}{d t}\left(H_{\uparrow}+H_{\downarrow}\right)=\frac{d}{d t}(H) \leqslant 0\).
d) - Looks like well have to write oof \(\mathrm{dH} / \mathrm{dt}\) anyloaty. Fine, let's do it.
\begin{align*}
\begin{aligned}
\frac{d H_{\uparrow}}{d t}=\frac{1}{4} \int & d^2 \vec{q} d^2 \vec{p}_1 d^2 \vec{p}_2 d \Omega\left|v_1-v_2\right| \frac{d \sigma}{d \Omega}\left[\ln \left(f_{\uparrow}\left(\vec{p}_1\right) f_{\uparrow}\left(\vec{p}_2\right)\right)\right. \\
& -\ln \left(f_{\uparrow}\left(\vec{p}_1^{\prime}\right) f_{\uparrow}\left(\vec{p}_2^{\prime}\right)\right] \times\left[f_{\uparrow}\left(\overrightarrow{p_1}\right) f_1\left(\overrightarrow{p_2}\right)-f_{\uparrow}\left(\vec{p}_1\right) f_1\left(\mu^2\right)\right.
\end{aligned}
\end{align*}

- \(\frac{d H}{d t} \uparrow\) is similarly written as:
\begin{align*}
\begin{aligned}
& \frac{d H_{\uparrow}}{d t}=-\frac{1}{2} \int d^2 q d^2 p_1 d^2 p_2 d \Omega\left|v_1-\nu_2\right| \frac{d \sigma_x}{d \Omega}\left[\ln f_{\uparrow}\left(\overrightarrow{p_1}\right)-\ln f_{\uparrow}\left(\overrightarrow{p_1}\right)\right] \\
& x\left[f_{\uparrow}\left(\vec{p}_1\right) f_{\downarrow}\left(\overrightarrow{p_2}\right)-f_{\uparrow}\left(\vec{p}_1^{\prime}\right) f_{\downarrow}\left(\vec{p}_2\right)\right] \\
&
\end{aligned}
\end{align*}
- \(d H_{\Delta \downarrow} / d t\) and \(d H_{\downarrow \uparrow} / d t\) are written in a similar manner \(\rightarrow\) just replace \(\uparrow\) with \(\downarrow\) and \(\downarrow\) with \(\uparrow\) in each cAse, along with \(\overrightarrow{p_1} \rightarrow \overrightarrow{p_2}\), and \(\vec{p}_1^{\prime} \rightarrow \vec{p}_2^{\prime}\)
- For \(d H_{\uparrow \uparrow} / d t\) to vanish, we must have (at exch point \(\vec{q}\) ):
\begin{align*}
\ln f_{\uparrow}\left(\vec{p}_1\right)+\ln f_{\uparrow}\left(\vec{p}_2\right)=\ln f_{\uparrow}\left(\vec{p}_1^{\prime}\right)+\ln f_{\uparrow}\left(\vec{p}_2^{\prime}\right)
\end{align*}
- This is equivalent to saying
\begin{align*}
\overrightarrow{p_1}+\overrightarrow{p_2}={\overrightarrow{p_1}}^{\prime}+{\overrightarrow{p_2}}^{\prime}
\end{align*}
- This is in general true for an in elastic collision. Thus \(d H \pi r / d t=0\)
- In fact this will be true of any \(\operatorname{lnf}\) which is, at each location, a linear combination of quantities conserved in the collision.
- For \(d H_{\uparrow \downarrow} / d t\) (or \(d H_{\downarrow \uparrow} / d t\) ) to vanish, we must have (at exch point \(\vec{q}\) ):
\begin{align*}
\ln f_{\downarrow}\left(\overrightarrow{p_2}\right)+\ln f_{\uparrow}\left(\overrightarrow{p_1}\right)=\ln f_{\downarrow}\left(\vec{p}_2^{\prime}\right)+\ln f_{\uparrow}\left(\vec{p}_1^{\prime}\right)
\end{align*}
- Notice the difference between (1) and (2). (1) involves \(\uparrow\) only but (2) involves and \(\uparrow\) and \(\downarrow\). This constrains the scalar that multiplies the conserved quantities (all \(n\) b of the number density of op and down spins) - they cannot be functions of the spins of the colliding particles. So long as this constraint is obeyed, \(d H / d t=0\) for thy \(\ln f\) that at each ans is a linear combination of consented the quantities. 

(e) The ask is to show,
- Let \(\left\{c_i\right\}\) be the conserved quantities under the onebody Jtanithion \(\mathcal{H}_{\uparrow}\) and \(\mathcal{H}_{\downarrow}\) If \(f_{\uparrow}\), and \(f \downarrow\) are functions only of these quantities ie:
\begin{align*}
f_{\uparrow} \equiv f_{\uparrow}\left(\left\{c_i\right\}\right) \text { and } f_{\downarrow} \equiv f_{\downarrow}\left(\left\{c_i\right\}\right)
\end{align*}
then.
\begin{align*}
\begin{aligned}
& \text { then. } \\
& \left\{f_{\uparrow}, H_{\uparrow}\right\}=\sum_i \frac{\partial f_{\uparrow}}{\partial C_i}\left\{C_i, H_{\uparrow}^0\right\}=0 \\
& \left\{f_{\downarrow}, H_{\downarrow}\right\}=\sum_i \frac{\partial f_{\downarrow}}{\partial C_i}\left\{C_i, J_{\downarrow}\right\}=0
\end{aligned}
\end{align*}
- The ait has been answered.
f)
During Collisions
\begin{align*}
\begin{aligned}
& \vec{p}_1+\vec{p}_2=\vec{p}_1^{\prime}+\vec{p}_2^{\prime} \\
& \vec{q} \times\left(\vec{p}_1+\vec{p}_2\right)=\vec{q} \times\left(\vec{p}_1^{\prime}+\vec{p}_2^{\prime}\right) \\
& \overrightarrow{L_1}+\overrightarrow{L_2}=\overrightarrow{L_1}+\overrightarrow{L_2^{\prime}} \\
&
\end{aligned}
\end{align*}

Away from Collisions
\begin{align*}
\{\vec{L}, H\}
\end{align*}
\begin{align*}
\begin{aligned}
= & -\left\{\vec{p}^2, \vec{L}\right\} / 2 m \text { (ii) } \\
& -\frac{\{\vec{p} \times \vec{B} \cdot \vec{q}, \vec{L}\} e}{2 m} \\
= & \left\{\vec{q}^2, \vec{L}\right\} \frac{e^2 B^2}{8 m} \\
+ & \left\{(\vec{B} \cdot \vec{q})^2, \vec{L}\right\} e^2 / \delta m
\end{aligned}
\end{align*}
(iv)

- For (i), (iii), and (iv), expand the cross-broduct using a bevi-civita pseudotensor and you'll see it. For (ii), first move stuff around using the property of A scalar triple product and then use the properties of the poisson bracket (poisson bracket of a function with a multiple of itself vanishes) and you'll see it.
- Therefore,
\begin{align*}
\begin{aligned}
& \left.\overrightarrow{L_1}+\overrightarrow{L_2}={\overrightarrow{L_1}}^{\prime}+{\overrightarrow{L_2}}^{\prime} \quad \text { (collision) }\right\} \text { at } \\
& \{\vec{L}, H\}=0 \quad \text { (away from collision) }\} \vec{q} \\
&
\end{aligned}
\end{align*}
- The angular momentum \(\vec{L}=\vec{q} \times \vec{p}\) is conserved during and away from collisions.
(9) The most general local equilibrium distribution is written is
\begin{align*}
\begin{aligned}
\ln f_{\uparrow} & =a_{\uparrow}(\vec{q})-\vec{\alpha}(\vec{q}) \cdot \vec{p}-\beta(\vec{q})(\underbrace{\left(\frac{\vec{p}}{2 m}+u_{\uparrow}(\vec{q})\right)} \\
\Rightarrow f_{\uparrow} & =\mathcal{N}(\vec{q}) \exp [-\vec{\alpha}(\vec{q}) \cdot \vec{p}-\beta(\vec{q}) H-\gamma(\vec{q})] H_{\uparrow}(\vec{p}, \vec{q}) .
\end{aligned}
\end{align*}
- The local equilibrium distribution preserves its form during collisions but evolves aw at from collisions
- For the global equilibrium distribution, we must further impose the condition of vanishing steaming terms, ie \(\left\{f_{\uparrow}, \mathcal{H} \uparrow\right\}=0\).
- In that case, weill need to fodrop \(-\vec{\alpha}(\vec{q}) \cdot \vec{p}\) from the argument of the exponent, (2) and demand that \(\mathcal{N}\) and \(\beta\) NOT be functions of \(\vec{q}\).
- (1) shouldn't surprise you. Linear momentum is conserved during a collision but NOT -(ii) we have already justified.
- Therefore, the most general form for the equilibrium distribution functions for particles confined to a circularly symmetric potential is:
\begin{align*}
\begin{aligned}
& f_{\uparrow}=\mathcal{N}_{\uparrow} \exp \left[-\beta H_{\uparrow}-\gamma L_z\right] \\
& f_{\downarrow}=\mathcal{N}_{\downarrow} \exp \left[-\beta H_{\downarrow}-\gamma L_z\right]
\end{aligned}
\end{align*}
(h) Scattering from magnetic impurities
- \(\vec{P} \& \vec{L}\) is no longer conserved during collisions,
\(-\gamma L_z\) term will be dropped.
- Collisions are no longer spin-conserving. Equilibrium will be characterized by equal numbers of of and down spin electron. \(\left(_{\uparrow}=\mathcal{N}_{\downarrow}=\mathcal{N}_{\mathcal{N}}\right)\)
\begin{align*}
f_{\uparrow}=\mathcal{N} \exp \left(-\beta H_{\uparrow}\right), f_{\downarrow}=\mathcal{N} \exp \left(-\beta H_{\downarrow}\right)
\end{align*}

Scattering from non-magnetic impurities
- \(-\gamma L_z\) term is doffed. (Collisions don't conserve \(\vec{p}\) no more).
- Collisions the spin-conserving still.
\begin{align*}
f_{\uparrow}=N_{\uparrow} \exp \left(-\beta H_{\uparrow}\right), \quad f_{\downarrow}=\mathcal{N}_{\downarrow} \exp \left[-\beta \mathcal{H}_{\downarrow}\right]
\end{align*}
(i) Conservation of angular momentum does not read to new hydrodynamic equations.
(if you like, it leads to 2 an equation for the angular velocity, tile such an equation is trivially ob tailed from the hydrodynamic equation for the velocity field).
- Conservation of spin does lead to a new non trivia hydrodynamic equation for the quantity ker-kerticle magnetisation. \(m\). \(m a\) for \(x_{\uparrow}+x_{\uparrow}\)
\begin{align*}
m \propto n_{\uparrow}-n_{\downarrow}
\end{align*}

